app/views/admin_users/list.html.erb

			<td class="center"> <%= mail_to(admin_users.email) %> </td>
			<td class="center"> <%= subject.pages.size %> </td>
---
SELECT "pages".* FROM "pages" INNER JOIN "admin_users_pages" ON "pages"."id" = "admin_users_pages"."page_id" WHERE "admin_users_pages"."admin_user_id" = 1