app/controllers/admin_users_controller.rb

  def create
	@admin_user = AdminUser.new(params[:admin_user])
	if @admin_user.save
---
INSERT INTO "admin_users" ("created_at", "email", "first_name", "hashed_password", "last_name", "salt", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def edit
	@admin_user = AdminUser.find(params[:id])
---
SELECT "admin_users".* FROM "admin_users" WHERE "admin_users"."id" = ? LIMIT 1  [["id", "1"]]

  def update
	@admin_user = AdminUser.find(params[:id])
	if @admin_user.update_attributes(params[:admin_user])
---
SELECT "admin_users".* FROM "admin_users" WHERE "admin_users"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "admin_users" SET "email" = 'test@test12.com', "username" = 'testyoufuck12', "updated_at" = '2012-03-01 21:09:10.310845' WHERE "admin_users"."id" = 2