app/controllers/pages_controller.rb

	def list
		@pages = Page.order("pages.position ASC")
---
SELECT "pages".* FROM "pages" ORDER BY pages.position ASC

	def new
		@page = Page.new
		@page_count = Page.count + 1
		@subjects = Subject.order('position ASC')
---
SELECT COUNT(*) FROM "pages"
SELECT "subjects".* FROM "subjects" ORDER BY position ASC

	def create
		@subjects = Subject.order('position ASC')
		@Page = Page.new(params[:page])
		if @Page.save
			flash[:notice] = "New page saved"
			list
			render('list')
		else
			@page_count = Page.count + 1
---
SELECT "subjects".* FROM "subjects" ORDER BY position ASC
INSERT INTO "pages" ("created_at", "name", "permalink", "position", "subject_id", "updated_at", "visible") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT COUNT(*) FROM "pages"

	def edit
		@page = Page.find(params[:id])
		@page_count = Page.count
		@subjects = Subject.order('position ASC')
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "4"]]
SELECT COUNT(*) FROM "pages"
SELECT "subjects".* FROM "subjects" ORDER BY position ASC

	def update
		@subjects = Subject.order('position ASC')
		@page = Page.find(params[:id])
		if @page.update_attributes(params[:page])
		flash[:notice] = "Page updated successfully"
		list
		render('list')
	else
		@page_count = Page.count
---
SELECT "subjects".* FROM "subjects" ORDER BY position ASC
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "pages" SET "permalink" = 'permalink1', "updated_at" = '2012-02-24 20:43:20.681427' WHERE "pages"."id" = 4
SELECT COUNT(*) FROM "pages"

	def delete
	 	@page = Page.find(params[:id])
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "4"]]

 	def destroy
 	name = Page.find(params[:id]).name
 	Page.find(params[:id]).destroy
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "pages" WHERE "pages"."id" = ?  [["id", 4]]