app/controllers/sections_controller.rb

SELECT "sections".* FROM "sections" ORDER BY sections.position ASC
---
  def list
    @sections = Section.order("sections.position ASC")

SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @section = Section.find(params[:id])

SELECT COUNT(*) FROM "sections"
---
  def new
    @section = Section.new
    @section_count = Section.count + 1

INSERT INTO "sections" ("content", "content_type", "created_at", "name", "page_id", "position", "updated_at", "visible") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT COUNT(*) FROM "sections"
---
  def create
    @section = Section.new(params[:section])
    if @section.save
      flash[:notice] = "Section created."
      redirect_to(:action => 'list')
    else
     @section_count = Section.count + 1

SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "1"]]
SELECT COUNT(*) FROM "sections"
---
  def edit
    @section = Section.find(params[:id])
    @section_count = Section.count

SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "sections" SET "visible" = 't', "content_type" = 'text', "content" = 'testing this shit', "updated_at" = '2012-02-26 17:44:16.557493' WHERE "sections"."id" = 1
---
  def update
    @section = Section.find(params[:id])
    if @section.update_attributes(params[:section])

SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "2"]]
---
  def delete
    @section = Section.find(params[:id])

DELETE FROM "sections" WHERE "sections"."id" = ?  [["id", 2]]
SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "2"]]
---
  def destroy
    Section.find(params[:id]).destroy