app/controllers/subjects_controller.rb

	def list

	@subjects =	Subject.order("subjects.position ASC")
---
SELECT "subjects".* FROM "subjects" ORDER BY subjects.position ASC

	def show
	@subject = Subject.find(params[:id])
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", "1"]]

	def new
	@subject = Subject.new
	@subject_count = Subject.count + 1
---
SELECT COUNT(*) FROM "subjects"

	def create
		# Instantiate a new object using form parameters
		@subject = Subject.new(params[:subject])
		# Save the object
		if @subject.save
				# If save succeeds , redirect to the list action
				flash[:notice] = "subject created."
			redirect_to(:action => 'list')
			# If save fails, redisplay the form so user can fix problems
		else
			@subject_count = Subject.count + 1
---
INSERT INTO "subjects" ("created_at", "name", "position", "updated_at", "visible") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 23 Feb 2012 17:57:21 UTC +00:00], ["name", "Test subject"], ["position", 8], ["updated_at", Thu, 23 Feb 2012 17:57:21 UTC +00:00], ["visible", false]]
SELECT COUNT(*) FROM "subjects"

	def edit
		@subject = Subject.find(params[:id])
		@subject_count = Subject.count
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", "1"]]
SELECT COUNT(*) FROM "subjects"

	def update
	# find a new object using form parameters
		@subject = Subject.find(params[:id])
		# update the object
		if @subject.update_attributes(params[:subject])
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "subjects" SET "position" = 7, "updated_at" = '2012-02-23 18:54:31.434179' WHERE "subjects"."id" = 5

	def delete
	@subject = Subject.find(params[:id])
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", "1"]]

	def destroy
	Subject.find(params[:id]).destroy
---
DELETE FROM "subjects" WHERE "subjects"."id" = ?  [["id", 5]]
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", "5"]]